
from django.db.models.functions import Lower,Trim

choises_rating = (
    ('1','1'),
    ('2','2'),
    ('3','3'),
    ('4','4'),
    ('5','5'),
    ('6','6'),
    ('7','7'),
    ('8','8'),
    ('9','9'),
    ('10','10'),
)

def search_filter(request):
    from KinoVibe.models import Videofile
    
    key = str(request.GET.get('key'))
    movie = Videofile.objects.filter(title__icontains=key)
    return movie

country = (
    ("Алжир","Алжир"),
    ("Иордания","Иордания"),
    ("Кувейт","Кувейт"),
    ("Оман","Оман"),
    ("Буркина-Фасо","Буркина-Фасо"),
    ("Китай","Китай"),
    ("Малайзия","Малайзия"),
    ("Монголия","Монголия"),
    ("Австрия","Австрия"),
    ("Испания","Италия"),
    ("Казахстан","Казахстан"),
    ("Кыргызстан","Кыргызстан"),
    ("Таджикистан","Таджикистан"),
    ("Франция","Франция"),
    ("Хорватия","Хорватия"),
    ("Узбекистан","Узбекистан"),
)

careers = (
    ("Актер","Актер"),
    ("актриса","актриса"),
    ("Гримёр","Гримёр"),
    ("Декоратор","Декоратор"),
    ("Звукорежиссер","Звукорежиссер"),
    ("Костюмер","Костюмер"),
    ("Режиссер-постановщик","Режиссер-постановщик"),
    ("Сценарист","Сценарист"),
    ("Хореограф","Хореограф"),
    ("модель","модель"),
    ("певец","певец"),
)